# ğŸˆ pandas ë°ì´í„° ì¡°ì‘

- ë°ì´í„° ì§‘ê³„
    - ë¹ˆë„, ë¹„ìœ¨, í•©ê³„, í‰ê· , ìµœëŒ€ê°’, ìµœì†Œê°’ ë“±
- ë°ì´í„° ì •ë ¬
- ê²°ì¸¡ì¹˜ ì²˜ë¦¬
- apply()
- ë°ì´í„° ë²”ì£¼í™”
- ì¸ë±ìŠ¤ ë³€ê²½

In [2]:
# ëª¨ë“ˆ import
import numpy as np
import pandas as pd

In [3]:
# ì„¤ì • ë³€ê²½ ì½”ë“œ
# ë³€ìˆ˜ ëª…ì´ ë‘ë²ˆ ì´ìƒ ì¶œë ¥ë˜ì–´ë„ ëª¨ë‘ ì½˜ì†”ì—ì„œ ë³´ì—¬ì¤„ ê²ƒ
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

# InteractiveShell.ast_node_interactivity : 'all' | 'last' | 'last_expr' | 'none' (ê¸°ë³¸ê°’ì€ 'last_expr')

## ğŸˆ ë°ì´í„° ì§‘ê³„

## 1. ë°ì´í„° ê°œìˆ˜ ì„¸ê¸°

- count() í•¨ìˆ˜ 
    - NaNê°’ì€ ì„¸ì§€ ì•ŠìŒ

- value_count() í•¨ìˆ˜

### âœ” ì‹œë¦¬ì¦ˆì— count()ì ìš©í•˜ì—¬ ê°œìˆ˜ ì„¸ê¸°

In [11]:
# ì‹œë¦¬ì¦ˆ ìƒì„±
s = pd.Series(np.arange(10))
s

1     0
2     1
3     2
4     3
5     4
6     5
7     6
8     7
9     8
10    9
dtype: int32

In [9]:
# nan ì†ì„±ì„ ì´ìš©í•´ì„œ NaN ê°’ì„ ì €ì¥
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [10]:
# ì‹œë¦¬ì¦ˆ ê°œìˆ˜ ì„¸ê¸°
s.count()   # ê²°ì¸¡ì¹˜ë¥¼ ì œì™¸í•˜ê³  ì¹´ìš´íŠ¸í•¨

9

### âœ” ë°ì´í„° í”„ë ˆì„ì— count()í•¨ìˆ˜ ì ìš©
- ê° ì—´ë§ˆë‹¤ ë°ì´í„° ê°œìˆ˜ë¥¼ ì„¸ê¸° ë•Œë¬¸ì— ëˆ„ë½ëœ ë¶€ë¶„ì„ ì°¾ì„ ë•Œ ìœ ìš©

**ë‚œìˆ˜ ë°œìƒì‹œì¼œ ë°ì´í„°í”„ë ˆì„ ìƒì„±**

- ì°¸ê³ . ë‚œìˆ˜ ìƒì„±
    - seed(ê°’) í•¨ìˆ˜ ì‚¬ìš©í•˜ì—¬ ë™ì¼í•œ ë‚œìˆ˜ ë°œìƒ
        - seed : ë‚œìˆ˜ ì•Œê³ ë¦¬ì¦˜ì—ì„œ ì‚¬ìš©í•˜ëŠ” ê¸°ë³¸ ê°’
        - seed ê°’ì´ ê°™ìœ¼ë©´ ë™ì¼í•œ ë‚œìˆ˜ ë°œìƒ
        - ì˜ˆ. np.random.seed(10) 

    - ê³„ì† ë³€ê²½ë˜ëŠ” ë‚œìˆ˜ë¥¼ ìƒì„±í•˜ë ¤ë©´ time.time()ì„ ì‚¬ìš©í•˜ì—¬ ì‹œë“œê°’ì´ ë§¤ë²ˆ ë³€í•˜ë„ë¡ ì§€ì •
        - ì˜ˆ. np.random.seed(int(time.time()))

In [13]:
# ê³ ì • ì‹œë“œê°’
np.random.seed(20)
np.random.randint(5, size=4)

array([3, 2, 4, 2])

In [16]:
# ë³€ê²½ ì‹œë“œê°’
import time

np.random.seed(int(time.time()))
np.random.randint(5, size=4)

array([1, 2, 1, 4])

- 4í–‰ 4ì—´ ì‹¤ìˆ˜í˜• ë°ì´í„°ë¥¼ ê°–ëŠ” ë°ì´í„° í”„ë ˆì„ ìƒì„±
    - ë°ì´í„° 0~4ë²”ìœ„ì˜ ë‚œìˆ˜ ë°œìƒ

In [19]:
np.random.seed(3)
df1 = pd.DataFrame(np.random.randint(5, size=(4,4)))
df1

   0  1  2  3
0  2  0  1  3
1  0  0  0  3
2  2  3  1  1
3  2  0  4  4

In [20]:
df1.count()

0    4
1    4
2    4
3    4
dtype: int64

=> ë°ì´í„° í”„ë ˆì„ì´ë¯€ë¡œ ê° ì—´ì˜ ì›ì†Œì˜ ê°¯ìˆ˜ë¥¼ ì‹œë¦¬ì¦ˆ í˜•íƒœë¡œ ë°˜í™˜

In [21]:
# NaN ë¶€ì—¬
df1.iloc[2,3]=np.nan
df1

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [22]:
df1.count()

0    4
1    4
2    4
3    3
dtype: int64

## âœ” ì‹¤ì „ ë°ì´í„°ì— count() ì ìš©

- íƒ€ì´íƒ€ë‹‰ ìŠ¹ê° ë°ì´í„° ì‚¬ìš©
    - seaborn íŒ¨í‚¤ì§€ ë‚´ì— dataë¡œ ì¡´ì¬
    - ë°ì´í„°ì…‹ ì½ì–´ì˜¤ê¸° : íŒ¨í‚¤ì§€ëª….load_dataset("dataëª…")

In [25]:
import seaborn as sns # seaborn íŒ¨í‚¤ì§€ : ê·¸ë˜í”„ íŒ¨í‚¤ì§€

titanic = sns.load_dataset('titanic')
titanic
titanic.head()
titanic.tail()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
886,0,2,male,27.0,0,0,13.00,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.00,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

In [26]:
#titanic dfì˜ ê° ì—´ì˜ ì›ì†Œ ê°œìˆ˜ë¥¼ ì‚°ì¶œ - count() í•¨ìˆ˜ ì´ìš©

titanic.count()     # ê²°ì¸¡ì¹˜ë¥¼ ì²´í¬í•˜ê¸° ìœ„í•´ count() ê°€ í•„ìš”í•¨, ì´ì‚°ë°ì´í„°ì— ì‚¬ìš©

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

###  âœ” ì¹´í…Œê³ ë¦¬ ê°’ ì„¸ê¸° 

- ì‹œë¦¬ì¦ˆ, ë°ì´í„°í”„ë ˆì„ì˜ ë²”ì£¼í˜• ë°ì´í„°ì— ëŒ€í•œ **ë²”ì£¼ë³„ ë¹ˆë„(ë¹„ìœ¨) ê³„ì‚°**
- **value_counts( )** í•¨ìˆ˜ ì ìš©

#### âœ ì‹œë¦¬ì¦ˆ ë°ì´í„°ì˜ ë¹ˆë„ ê³„ì‚°
- ì‹œë¦¬ì¦ˆì˜ ê°’ì´ ì •ìˆ˜,ë¬¸ìì—´ ë“± ì¹´í…Œê³ ë¦¬ ê°’ì¸ ê²½ìš°ì—
- ì‹œë¦¬ì¦ˆ.value_counts()ë©”ì„œë“œë¥¼ ì‚¬ìš©í•´ ê°ê°ì˜ ê°’ì´ ë‚˜ì˜¨ íšŸìˆ˜ë¥¼ ì…€ ìˆ˜ ìˆìŒ
- íŒŒë¼ë¯¸í„° normalize=True ë¥¼ ì‚¬ìš©í•˜ë©´ ê° ê°’ ë° ë²”ì£¼í˜• ë°ì´í„°ì˜ ë¹„ìœ¨ì„ ê³„ì‚°
    - ì‹œë¦¬ì¦ˆ.value_counts(normalize=True)

In [27]:
# í•­ìƒ ê°™ì€ ê°’ì´ ë‚˜ì˜¤ë„ë¡ ìƒì„±
np.random.seed(1)

In [29]:
# ë°ì´í„° ë§ˆì§€ë§‰ ë¶€ë¶„ í™•ì¸
s2 = pd.Series(np.random.randint(6,size=100))
s2

0     5
1     3
2     5
3     0
4     3
     ..
95    5
96    3
97    4
98    2
99    0
Length: 100, dtype: int32

In [30]:
# ë°ì´í„° ê¸¸ì´
len(s2)

100

In [32]:
# 0,1,2,3,4,5 ê° ê°’ì´ ëª‡ë²ˆ ë‚˜ì™”ëŠ”ì§€ í™•ì¸
s2.value_counts()

5    20
0    19
4    19
1    17
2    15
3    10
dtype: int64

#### âœ ë²”ì£¼í˜• ë°ì´í„°ì— value_counts() í•¨ìˆ˜ ì ìš©
- ë²”ì£¼í˜• ë°ì´í„° : ê´€ì¸¡ ë³„ê³¼ê°€ ëª‡ê°œì˜ ë²”ì£¼ ë˜ëŠ” í•­ëª©ì˜ í˜•íƒœë¡œ ë‚˜íƒ€ë‚˜ëŠ” ìë£Œ
    - ex. ì„±ë³„(ë‚¨,ì—¬), ì„ í˜¸ë„(ì¢…ë‹¤, ë³´í†µ, ì‹«ë‹¤), í˜ˆì•¡í˜•(A,B,O,AB) ë“±

In [34]:
# titanic df ì˜ alive ì—´ : ìƒì¡´ì—¬ë¶€ê°€ yes/no ë¡œ í‘œì‹œ ë˜ì–´ ìˆìŒ
# ë¬¸ìì—´(Object type)
titanic['alive'].dtype
# 
titanic['alive'].value_counts()

dtype('O')

no     549
yes    342
Name: alive, dtype: int64

In [36]:
# ìƒì¡´ì ì‚¬ë§ì ë¹„ìœ¨ ê³„ì‚°
titanic['alive'].value_counts(normalize=True)
titanic['alive'].value_counts(normalize=True) * 100

no     0.616162
yes    0.383838
Name: alive, dtype: float64

no     61.616162
yes    38.383838
Name: alive, dtype: float64

#### âœ ë°ì´í„°í”„ë ˆì„ì—  value_counts()  í•¨ìˆ˜ ì‚¬ìš©


- í–‰ì„ í•˜ë‚˜ì˜ valueë¡œ ì„¤ì •í•˜ê³  ë™ì¼í•œ í–‰ì´ ëª‡ë²ˆ ë‚˜íƒ€ë‚¬ëŠ”ì§€ ë°˜í™˜
- í–‰ì˜ ê²½ìš°ê°€ ì¸ë±ìŠ¤ë¡œ ê°œìˆ˜ëœ ê°’ì´ valueë¡œ í‘œì‹œë˜ëŠ” Series ë°˜í™˜

In [37]:
# ì˜ˆì œ df
df = pd.DataFrame({
                 'num_legs':[2,4,4,6],
                 'num_wings':[2,0,0,0]},
                index=['falcon','dog','cat','ant'])
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [38]:
df.value_counts()

num_legs  num_wings
4         0            2
2         2            1
6         0            1
dtype: int64

In [39]:
# ì˜ˆì œ df
df1

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [40]:
df1.value_counts()   # NaNì€ ì œì™¸

0  1  2  3
0  0  0  3.0    1
2  0  1  3.0    1
      4  4.0    1
dtype: int64

In [43]:
df1.value_counts().sort_index()
df1.value_counts().sort_index().index

0  1  2  3
0  0  0  3.0    1
2  0  1  3.0    1
      4  4.0    1
dtype: int64

MultiIndex([(0, 0, 0, 3.0),
            (2, 0, 1, 3.0),
            (2, 0, 4, 4.0)],
           names=[0, 1, 2, 3])

In [44]:
# column : ì‹œë¦¬ì¦ˆ -> value_count() ì ìš©ê°€ëŠ¥
df1[0].value_counts()
df1.iloc[2,3]=np.nan
df1
df1[3].value_counts()

2    3
0    1
Name: 0, dtype: int64

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

3.0    2
4.0    1
Name: 3, dtype: int64

## 2. ë°ì´í„° ì •ë ¬ 

- ë°ì´í„° ì •ë ¬ì„ ìœ„í•œ ì •ë ¬ í•¨ìˆ˜ ì‚¬ìš©
- **sort_index()** : ì¸ë±ìŠ¤ë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬
- **sort_value()** : ë°ì´í„° ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬

### 2-1. ì‹œë¦¬ì¦ˆ ì •ë ¬

In [45]:
#ì˜ˆì œ ì‹œë¦¬ì¦ˆ
s2

0     5
1     3
2     5
3     0
4     3
     ..
95    5
96    3
97    4
98    2
99    0
Length: 100, dtype: int32

In [46]:
# ê²°ê³¼ ì¸ë±ìŠ¤ê°€ ìˆœì„œ ì—†ì´ ë°˜í™˜
s2.value_counts()

#ì¸ë±ìŠ¤ ê¸°ì¤€ ì •ë ¬
s2.value_counts().sort_index()

5    20
0    19
4    19
1    17
2    15
3    10
dtype: int64

0    19
1    17
2    15
3    10
4    19
5    20
dtype: int64

In [47]:
#ì¸ë±ìŠ¤ ê¸°ì¤€ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬
s2.value_counts().sort_index(ascending=False)

5    20
4    19
3    10
2    15
1    17
0    19
dtype: int64

In [50]:
#ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ì˜¤ë¦„ì°¨ìˆœ ì •ë ¬
s2.value_counts().sort_values()

3    10
2    15
1    17
0    19
4    19
5    20
dtype: int64

In [49]:
#ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬
s2.value_counts().sort_values(ascending=False)

5    20
0    19
4    19
1    17
2    15
3    10
dtype: int64

In [51]:
s2.sort_values()

99    0
74    0
72    0
62    0
90    0
     ..
16    5
9     5
2     5
83    5
49    5
Length: 100, dtype: int32

### 2-2. ë°ì´í„° í”„ë ˆì„ ì •ë ¬

- df.sort_values() : íŠ¹ì •ì—´ ê°’ ê¸°ì¤€ ì •ë ¬
    - ë°ì´í„°í”„ë ˆì„ì€ 2ì°¨ì› ë°°ì—´ê³¼ ë™ì¼í•˜ê¸° ë•Œë¬¸ì—
        - ì •ë ¬ì‹œ ê¸°ì¤€ì—´ì„ ì¤˜ì•¼ í•œë‹¤. by ì¸ìˆ˜ ì‚¬ìš© : ìƒëµ ë¶ˆê°€
        - by = ê¸°ì¤€ì—´, by=[ê¸°ì¤€ì—´1,ê¸°ì¤€ì—´2]
    - ì˜¤ë¦„ì°¨ìˆœ/ë‚´ë¦¼ì°¨ìˆœ : ascending = True/False (ìƒëµí•˜ë©´ ì˜¤ë¦„ì°¨ìˆœ)
    
    
- df.sort_index() : DFì˜ INDEX ê¸°ì¤€ ì •ë ¬
    - ì˜¤ë¦„ì°¨ìˆœ/ë‚´ë¦¼ì°¨ìˆœ : ascending = True/False (ìƒëµí•˜ë©´ ì˜¤ë¦„ì°¨ìˆœ)

In [52]:
df1

   0  1  2    3
0  2  0  1  3.0
1  0  0  0  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [32]:
# df1.sort_values() #sort_values() missing 1 required positional argument: 'by'

In [53]:
df1.sort_values(by=0)

   0  1  2    3
1  0  0  0  3.0
0  2  0  1  3.0
2  2  3  1  NaN
3  2  0  4  4.0

In [54]:
df1.sort_values(by=[1,2])

   0  1  2    3
1  0  0  0  3.0
0  2  0  1  3.0
3  2  0  4  4.0
2  2  3  1  NaN

In [55]:
#1ì—´ì„ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬, 1ì—´ ê°’ì´ ë™ì¼ í• ë•ŒëŠ” 2ì—´ê°’ì„ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬
df.sort_index()

        num_legs  num_wings
ant            6          0
cat            4          0
dog            4          0
falcon         2          2

In [36]:
# ì˜ˆì œ df í™•ì¸
df

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

- ë°ì´í„°í”„ë ˆì„ì˜ indexë¥¼ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬

In [56]:
df.sort_values(by='num_legs')

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

In [37]:
# ì¸ë±ìŠ¤ ê¸°ì¤€ ì •ë ¬
df.sort_index()

# ì¸ë±ìŠ¤ ê¸°ì¤€ ë‚´ë¦¼ì°¨ìˆœ ì •ë ¬
df.sort_index(ascending=False)

        num_legs  num_wings
ant            6          0
cat            4          0
dog            4          0
falcon         2          2

        num_legs  num_wings
falcon         2          2
dog            4          0
cat            4          0
ant            6          0

---------------------------------------------------

### â“ ì—°ìŠµë¬¸ì œ 

1. íƒ€ì´íƒ€ë‹‰ ë°ì´í„°ì—ì„œ ìŠ¹ê°ì˜ ì„±ë³„(sex) ì¸ì›ìˆ˜, ë‚˜ì´ë³„(age) ì¸ì›ìˆ˜, ì„ ì‹¤ë³„(class) ì¸ì›ìˆ˜, ì‚¬ë§/ìƒì¡´(alive)ì¸ì›ìˆ˜ë¥¼ êµ¬í•˜ì‹œì˜¤.

2. ì„±ë³„ ì¸ì›ìˆ˜ëŠ” ì¸ë±ìŠ¤ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬í•˜ê³ , ë‚˜ì´ë³„ ì¸ì›ìˆ˜ëŠ” ê°’ ê¸°ì¤€ìœ¼ë¡œ ì •ë ¬í•˜ë©°, ë‚˜ë¨¸ì§€ëŠ” ì„ì˜ ê¸°ì¤€ìœ¼ë¡œ ì„ ì •í•˜ì—¬ ì •ë ¬ í•˜ì‹œì˜¤.

In [169]:
# íƒ€ì´íƒ€ë‹‰ ìŠ¹ê°ì— ëŒ€í•˜ì—¬ ì„±ë³„ ì¸ì›ìˆ˜ êµ¬í•˜ê¸°
titanic['sex'].value_counts().sort_index(ascending=True)

female    314
male      577
Name: sex, dtype: int64

In [174]:
# íƒ€ì´íƒ€ë‹‰ ìŠ¹ê°ì— ëŒ€í•˜ì—¬ ë‚˜ì´ë³„ ì¸ì›ìˆ˜ êµ¬í•˜ê¸°
titanic['age'].value_counts().sort_values()

74.00     1
34.50     1
0.42      1
0.67      1
66.00     1
         ..
28.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [177]:
# íƒ€ì´íƒ€ë‹‰ ìŠ¹ê°ì— ëŒ€í•˜ì—¬ ì„ ì‹¤ë³„ ì¸ì›ìˆ˜ êµ¬í•˜ê¸°
#íŒŒì´ì¬ì—ì„œëŠ” í˜•íƒœ ë¶„ë¥˜ classë¡œ ì‘ì—…

titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [179]:
#íƒ€ì´íƒ€ë‹‰ ìŠ¹ê°ì— ëŒ€í•˜ì—¬ ì‚¬ë§/ìƒì¡´ ì¸ì›ìˆ˜ êµ¬í•˜ê¸°
titanic['alive'].value_counts()

no     549
yes    342
Name: alive, dtype: int64

In [42]:
#íƒ€ì´íƒ€ë‹‰ ìŠ¹ê°ì— ëŒ€í•˜ì—¬ ì‚¬ë§/ìƒì¡´ ì¸ì›ìˆ˜ êµ¬í•˜ê¸°
#.ì—°ì‚°ì ì´ìš©í•´ì„œ dataì— ì ‘ê·¼

no     549
yes    342
Name: alive, dtype: int64

------------------------------------------------------

## 3. í–‰/ì—´ì˜ í•©ê³„

- **df.sum()** í•¨ìˆ˜ ì‚¬ìš©
- í–‰ê³¼ ì—´ì˜ í•©ê³„ë¥¼ êµ¬í• ë•ŒëŠ” sum(axis=0/1) - axisëŠ” 0ì´ ê¸°ë³¸
    - ê° í–‰ë¼ë¦¬ ê³„ì‚°í•˜ì—¬ í•©ê³„ë¥¼ êµ¬í• ë•ŒëŠ” sum(axis=0)
    - ê° ì—´ë¼ë¦¬ ê³„ì‚°í•˜ì—¬ í•©ê³„ë¥¼ êµ¬í• ë•ŒëŠ” sum(axis=1)

âœ” ë°ì´í„° í”„ë ˆì„ ìƒì„±

# ì˜ˆì œ DF ìƒì„±
# 4í–‰ 8ì—´ì˜ ë°ì´í„°í”„ë ˆì„ ì‘ì„±, ë‚œìˆ˜ë¥¼ ë°œìƒì‹œí‚¤ê³ 
# 0-9ë²”ìœ„ì—ì„œ ë§¤ë²ˆ ê°™ì€ ë‚œìˆ˜ ë°œìƒë˜ì–´ ë°˜í™˜ë˜ë„ë¡ ì„¤ì •

In [58]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

**ê° í–‰ì˜ í•©ê³„ ê³„ì‚°**

In [59]:
# ê° ì—´ë¼ë¦¬ ê³„ì‚°í•˜ì—¬ í•©ê³„ë¥¼ êµ¬í• ë•ŒëŠ” sum(axis=1)
df2.sum(axis=1)
# ì‹œë¦¬ì¦ˆ í˜•íƒœë¡œ ë°˜í™˜

0    35
1    34
2    41
3    42
dtype: int64

**ê° ì—´ì˜ í•©ê³„ ê³„ì‚°**

In [60]:
# ê° í–‰ë¼ë¦¬ ê³„ì‚°í•˜ì—¬ í•©ê³„ë¥¼ êµ¬í• ë•ŒëŠ” sum(axis=0)
df2.sum(axis=0)

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [61]:
# axisì¸ìˆ˜ ìƒëµ : df.sum() : ê¸°ë³¸ê°’ì´ 0ì´ë¯€ë¡œ ê° í–‰ë¼ë¦¬ ê³„ì‚°í•œ í•©ê³„ë¥¼ êµ¬í•œë‹¤.
df2.sum()

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

## 4. í‰ê· , ìµœì†Œê°’, ìµœëŒ€ê°’

- ë°ì´í„°í”„ë ˆì„ì— ì ìš©ë˜ëŠ” ì§‘ê³„ ê´€ë ¨ í•¨ìˆ˜
    - í‰ê·  : mean(axis=0/1)
    - ìµœì†Œê°’ : min(axis=0/1)
    - ìµœëŒ€ê°’ : max(axis=0/1)

In [62]:
# ì˜ˆì œ DF í™•ì¸
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [63]:
# dfì˜ ê¸°ë³¸ í•¨ìˆ˜ : min(), max(), mean()
df2.mean()
df2.min()
df2.max()

0    6.00
1    8.25
2    6.25
3    6.00
4    3.75
5    2.50
6    1.25
7    4.00
dtype: float64

0    4
1    7
2    2
3    4
4    0
5    0
6    0
7    1
dtype: int32

0    9
1    9
2    9
3    9
4    9
5    7
6    4
7    7
dtype: int32

In [164]:
# ê° ì—´ë¼ë¦¬ ê³„ì‚°í•œ í•©ê³„ë¥¼ ì—´ë¡œ ì¶”ê°€

df2['RowSum'] = df2.sum(axis=1)
df2

             0   1   2   3   4   5  6   7  RowSum
0          NaN   8   9   5   0   0  1   7    65.0
1          6.0   9   2   4   5   2  4   2    68.0
2          4.0   7   7   9   1   7  0   6    82.0
3          9.0   9   7   6   9   1  0   1    84.0
ColTotal  24.0  33  25  24  15  10  5  16   304.0

In [65]:
#ìƒˆë¡œìš´ í–‰ ì¶”ê°€(loc ì¸ë±ì„œ ì‚¬ìš©ì´ ê°€ì¥ ê°„ë‹¨í•¨)
#ê° ì—´ì˜ í•©ê³„ë¥¼ êµ¬í•œí›„ì— í–‰ìœ¼ë¡œ ì¶”ê°€
#í–‰ ì´ë¦„ì€ ColTotal

df2.loc['ColTotal'] = df2.sum(axis=0)
df2

           0   1   2   3   4   5  6   7  RowSum
0          5   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
ColTotal  24  33  25  24  15  10  5  16     152

# ë°ì´í„° ì‚­ì œ

- drop() í•¨ìˆ˜

## í–‰ ì‚­ì œ
- df.drop('í–‰ì´ë¦„',0) : í–‰ì‚­ì œ 
     - í–‰ì‚­ì œ í›„ dfë¡œ ê²°ê³¼ë¥¼ ë°˜í™˜
- ì›ë³¸ì— ë°˜ì˜ë˜ì§€ ì•Šìœ¼ë¯€ë¡œ  ì›ë³¸ìˆ˜ì •í•˜ë ¤ë©´ ì €ì¥ í•´ì•¼ í•¨

In [66]:
# ê° í–‰ì˜ í•©ê³„ ê³„ì‚°
df2

           0   1   2   3   4   5  6   7  RowSum
0          5   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
ColTotal  24  33  25  24  15  10  5  16     152

In [67]:
# - df.drop('í–‰ì´ë¦„',0) : í–‰ì‚­ì œ 
#     - í–‰ì‚­ì œ í›„ dfë¡œ ê²°ê³¼ë¥¼ ë°˜í™˜
df2.drop('ColTotal',0)
df2

C:\Users\user\AppData\Local\Temp/ipykernel_536/1078596559.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df2.drop('ColTotal',0)

   0  1  2  3  4  5  6  7  RowSum
0  5  8  9  5  0  0  1  7      35
1  6  9  2  4  5  2  4  2      34
2  4  7  7  9  1  7  0  6      41
3  9  9  7  6  9  1  0  1      42

           0   1   2   3   4   5  6   7  RowSum
0          5   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
ColTotal  24  33  25  24  15  10  5  16     152

## ì—´ ì‚­ì œ
- df.drop('í–‰ì´ë¦„',1) : ì—´ ì‚­ì œ
     - í–‰ì‚­ì œ í›„ dfë¡œ ê²°ê³¼ë¥¼ ë°˜í™˜
- ì›ë³¸ì— ë°˜ì˜ë˜ì§€ ì•Šìœ¼ë¯€ë¡œ  ì›ë³¸ìˆ˜ì •í•˜ë ¤ë©´ ì €ì¥ í•´ì•¼ í•¨

In [68]:
# df.drop('ì»¬ëŸ¼ëª…(ì—´ì´ë¦„)',1) ì—´ì‚­ì œ - ì‚­ì œ í›„ dfë¡œ ë°˜í™˜
# ì›ë³¸ë°˜ì˜ì•ˆë¨
df2.drop('RowSum',1)
df2

C:\Users\user\AppData\Local\Temp/ipykernel_536/456257070.py:3: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df2.drop('RowSum',1)

           0   1   2   3   4   5  6   7
0          5   8   9   5   0   0  1   7
1          6   9   2   4   5   2  4   2
2          4   7   7   9   1   7  0   6
3          9   9   7   6   9   1  0   1
ColTotal  24  33  25  24  15  10  5  16

           0   1   2   3   4   5  6   7  RowSum
0          5   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
ColTotal  24  33  25  24  15  10  5  16     152

# ê²°ì¸¡ì¹˜ ì²˜ë¦¬

: **NaN ê°’ ì²˜ë¦¬** í•¨ìˆ˜

- **df.dropna(axis=0/1)**
    - NaNê°’ì´ ìˆëŠ” ì—´ ë˜ëŠ” í–‰ì„ ì‚­ì œ
    - ì›ë³¸ ë°˜ì˜ë˜ì§€ ì•ŠìŒ


- **df.fillna(0)**
    - NaNê°’ì„ ì •í•´ì§„ ìˆ«ìë¡œ ì±„ì›€
    - ì›ë³¸ ë°˜ì˜ ë˜ì§€ ì•ŠìŒ

### ê²°ì¸¡ì¹˜ ì ìš©

In [54]:
# df2ì— ê²°ì¸¡ì¹˜ ê°’ ì ìš©

             0   1   2   3   4   5  6   7  RowSum
0          NaN   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

### ê²°ì¸¡ì¹˜ í¬í•¨ í–‰ ì‚­ì œ : dropna()

In [69]:

df2.iloc[0,0] = np.nan
df2

             0   1   2   3   4   5  6   7  RowSum
0          NaN   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

In [71]:
# NaNì´ í¬í•¨ëœ í–‰ì„ ì‚­ì œ
df2.dropna()    # df2.dropna(axis=0) ê³¼ ê°™ë‹¤
df2

             0   1   2   3   4   5  6   7  RowSum
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

             0   1   2   3   4   5  6   7  RowSum
0          NaN   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

### ê²°ì¸¡ì¹˜ í¬í•¨ ì—´ ì‚­ì œ : dropna(axis=1)

In [56]:
#NaNì´ í¬í•¨ëœ ì—´ì‚­ì œ
df2.dropna(axis=1)

           1   2   3   4   5  6   7  RowSum
0          8   9   5   0   0  1   7      35
1          9   2   4   5   2  4   2      34
2          7   7   9   1   7  0   6      41
3          9   7   6   9   1  0   1      42
ColTotal  33  25  24  15  10  5  16     152

             0   1   2   3   4   5  6   7  RowSum
0          NaN   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

### ê²°ì¸¡ì¹˜ë¥¼ ë‹¤ë¥¸ ê°’ìœ¼ë¡œ ëŒ€ì²´ : fillna() í•¨ìˆ˜

In [73]:
df2  # ê²°ì¸¡ì¹˜ëŠ” ì‹¤ìˆ˜ í˜•íƒœì´ë¯€ë¡œ ë°”ê¾¸ê³  ë‚˜ë©´ 1.0ê³¼ ê°™ì€ í˜•ì‹ì´ ë¨.

             0   1   2   3   4   5  6   7  RowSum
0          NaN   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

**ê²°ì¸¡ì¹˜ë¥¼ 0ìœ¼ë¡œ ë³€ê²½**

In [72]:
df2.fillna(0)

             0   1   2   3   4   5  6   7  RowSum
0          0.0   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

: fillna() ì ìš© í›„ ê²°ê³¼ê°’ì€ ì‹¤ìˆ˜ê°€ ë¨ (NaNì´ ì‹¤ìˆ˜í˜•)

**ê²°ì¸¡ì¹˜ë¥¼ 1ë¡œ ë³€ê²½**

In [74]:
df2.fillna(1)

             0   1   2   3   4   5  6   7  RowSum
0          1.0   8   9   5   0   0  1   7      35
1          6.0   9   2   4   5   2  4   2      34
2          4.0   7   7   9   1   7  0   6      41
3          9.0   9   7   6   9   1  0   1      42
ColTotal  24.0  33  25  24  15  10  5  16     152

In [75]:
# NaN ì´ ì‹¤ìˆ˜í˜•ì´ì–´ì„œ fillna í›„ ê²°ê³¼ê°’ì´ ì‹¤ìˆ˜ ì„
# ì •ìˆ˜ ë³€í™˜ í•¨ìˆ˜ astype(ë°ì´í„°í˜•)

df2.fillna(0).astype(int)

           0   1   2   3   4   5  6   7  RowSum
0          0   8   9   5   0   0  1   7      35
1          6   9   2   4   5   2  4   2      34
2          4   7   7   9   1   7  0   6      41
3          9   9   7   6   9   1  0   1      42
ColTotal  24  33  25  24  15  10  5  16     152

# ğŸˆí–‰/ì—´ì— ë™ì¼í•œ ì—°ì‚° ì ìš©

- ì—´ ë˜ëŠ” í–‰ì— ë™ì¼í•œ ì—°ì‚° ë°˜ë³µ ì ìš©í•  ë•Œ


- apply() í•¨ìˆ˜
    - DataFrameì˜ í–‰ì´ë‚˜ ì—´ì— ë³µì¡í•œ ì—°ì‚°ì„ vectorizing í•  ìˆ˜ ìˆê²Œ í•´ì£¼ëŠ” í•¨ìˆ˜
    - ë§¤ìš° ë§ì´ í™œìš©ë˜ëŠ” í•¨ìˆ˜


- **í˜•ì‹ : apply(ë°˜ë³µì ìš©í•  í•¨ìˆ˜, axis=0/1)**
    - 0 : ì—´ë§ˆë‹¤ ë°˜ë³µ
    - 1 : í–‰ë§ˆë‹¤ ë°˜ë³µ 
    - ìƒëµì‹œ ê¸°ë³¸ê°’ : 0

### âœë°ì´í„°í”„ë ˆì„ ìƒì„±

In [76]:
# ì˜ˆì œ df ìƒì„±
df3 = pd.DataFrame({
    'a':[1,3,4,3,4],
    'b':[2,3,1,4,5],
    'c':[1,5,2,4,4]
})
df3

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

### âœë°ì´í„°í”„ë ˆì„ì˜ ê° ì—´ì— sum() í•¨ìˆ˜ ì ìš©

In [79]:
# df3ì˜ ê° ì—´ì— ëŒ€í•´ np.sum í•¨ìˆ˜ë¥¼ ë°˜ë³µ ì ìš©
# sumí•¨ìˆ˜ëŠ” ì—´ ë˜ëŠ” í–‰ë‹¨ìœ„ë¡œ ì ìš©ë˜ëŠ” í•¨ìˆ˜ì—¬ì„œ ê° ì—´ë³„ë¡œ ì ìš© ë¨
df3.sum(axis=0)
df3.apply(np.sum, 0)

a    15
b    15
c    16
dtype: int64

a    15
b    15
c    16
dtype: int64

**ë°ì´í„°í”„ë ˆì„ì˜ ê° í–‰ì— sum() í•¨ìˆ˜ ì ìš©**

In [81]:
# df3ì˜ ê° í–‰ì— ëŒ€í•´ np.sum í•¨ìˆ˜ë¥¼ ë°˜ë³µ ì ìš©
# sumí•¨ìˆ˜ëŠ” ì—´ ë˜ëŠ” í–‰ë‹¨ìœ„ë¡œ ì ìš©ë˜ëŠ” í•¨ìˆ˜ì—¬ì„œ ê° í–‰ë³„ë¡œ ì ìš© ë¨
df3.sum(axis=1)
df3.apply(np.sum,1)

0     4
1    11
2     7
3    11
4    13
dtype: int64

0     4
1    11
2     7
3    11
4    13
dtype: int64

**ë°ì´í„°í”„ë ˆì„ì˜ ê° ì›ì†Œì˜ ì œê³±ê°’ì„ ê³„ì‚°**

In [83]:
# df3ì˜ ê° ì—´ë³„ ëª¨ë“  ì›ì†Œì— ëŒ€í•˜ì—¬ np.square í•¨ìˆ˜ ì ìš©(ì œê³±ê°’)
# square í•¨ìˆ˜ëŠ” ì›ì†Œì— ì ìš©ì´ ê°€ëŠ¥ í•œ í•¨ìˆ˜ì´ë¯€ë¡œ ì—´ë³„ë¡œ ì›ì†Œì— ëŒ€í•˜ì—¬ ë²¡í„°í™” ì—°ì‚°ì„ ì§„í–‰
df3
df3.apply(np.square)

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

    a   b   c
0   1   4   1
1   9   9  25
2  16   1   4
3   9  16  16
4  16  25  16

**ë°ì´í„°í”„ë ˆì„ì˜ í–‰ë³„ë¡œ ê° ì›ì†Œì˜ ì œê³±ê°’ì„ ê³„ì‚°**

In [65]:
# í–‰ë³„ ê° ì›ì†Œì— ëŒ€í•˜ì—¬  np.square í•¨ìˆ˜ ì—°ì‚°ì„ ì§„í–‰ 
## ì›ì†Œì— ëŒ€í•˜ì—¬ ì§„í–‰í•˜ëŠ” í•¨ìˆ˜ì—¬ì„œ ì—´/í–‰ ëª¨ë‘ ë™ì¼í•œ ê²°ê³¼

    a   b   c
0   1   4   1
1   9   9  25
2  16   1   4
3   9  16  16
4  16  25  16

## ì‚¬ìš©ìê°€ ì •ì˜í•œ ì—°ì‚°ì„ í–‰/ì—´ë‹¨ìœ„ ì ìš© : lambda() & apply()

- ë°ì´í„°í”„ë ˆì„ì˜ ê¸°ë³¸ ì§‘ê³„í•¨ìˆ˜(sum, min, max, mean ë“±)ë“¤ì€ í–‰/ì—´ ë‹¨ìœ„ ë²¡í„°í™” ì—°ì‚°ì„ ìˆ˜í–‰í•¨
    - apply() í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•  í•„ìš”ê°€ ì—†ìŒ


- apply() í•¨ìˆ˜ ì‚¬ìš©ì€ ë³µì¡í•œ ì—°ì‚°ì„ í•´ê²°í•˜ê¸° ìœ„í•œ lambda í•¨ìˆ˜ë‚˜ ì‚¬ìš©ì ì •ì˜ í•¨ìˆ˜ë¥¼ ê° ì—´ ë˜ëŠ” í–‰ì— ì¼ê´„ ì ìš©ì‹œí‚¤ê¸° ìœ„í•´ ì‚¬ìš©
    - lambda í•¨ìˆ˜ë¡œ í•„ìš”í•œ ì—°ì‚° ê¸°ëŠ¥ì„ êµ¬í˜„í•˜ê³ , apply()ë¥¼ í†µí•´ ì—´/í–‰ ë‹¨ìœ„ë¡œ ì ìš©

### 1íšŒì„± í•¨ìˆ˜ lambda í•¨ìˆ˜ë¥¼  apply()ì—  ì‚¬ìš©í•˜ëŠ” ì˜ˆì œ

- ì§‘í•©ë°ì´í„°ì˜ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ì°¨ì´ë¥¼ êµ¬í•˜ëŠ” lambda í•¨ìˆ˜ ì •ì˜

In [87]:
# ì§‘í•©ë°ì´í„°ì˜ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ì°¨ì´ë¥¼ êµ¬í•˜ëŠ” lambda í•¨ìˆ˜
diff = lambda x : x.max() - x.min()

In [90]:
# df3ì˜ aì—´ì— ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ì°¨ì´ë¥¼ ìœ„ì—ì„œ ìƒì„±í•œ lambda í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ì—¬ êµ¬í•˜ì‹œì˜¤
df3
df3.apply(diff,0)
df3.apply(diff,1)

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

a    3
b    4
c    4
dtype: int64

0    1
1    2
2    3
3    1
4    1
dtype: int64

- ì •ì˜í•œ lambdaí•¨ìˆ˜ diif() ì ìš©

In [68]:
# apply í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ì—¬ ìœ„ì—ì„œ ìƒì„±í•œ lambda diffë¥¼ df3ì˜ ëª¨ë“  ì—´ì— ë°˜ë³µ ì ìš©í•˜ì—¬ ëª¨ë“  ì—´ì˜ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ì°¨ì´ë¥¼ êµ¬í•˜ì‹œì˜¤

a    3
b    4
c    4
dtype: int64

In [69]:
# apply í•¨ìˆ˜ë¥¼ ì´ìš©í•˜ì—¬ ìœ„ì—ì„œ ìƒì„±í•œ lambda diffë¥¼ df3ì˜ ëª¨ë“  í–‰ì— ë°˜ë³µ ì ìš©í•˜ì—¬ ëª¨ë“  í–‰ì˜ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ì°¨ì´ë¥¼ êµ¬í•˜ì‹œì˜¤

0    1
1    2
2    3
3    1
4    1
dtype: int64

- ì§ì ‘ ì—°ì‚°ìœ¼ë¡œ í†µí•´ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ ì°¨ì´ ê³„ì‚°

In [70]:
# ë‹¤ë¥¸ ë°©ë²• : ì§ì ‘ ì—°ì‚°
# df3ì˜ ê° ì—´ì— ëŒ€í•˜ì—¬ ìµœëŒ€ê°’ê³¼ ìµœì†Œê°’ì˜ ì°¨ì´ë¥¼ êµ¬í•˜ì‹œì˜¤

0    1
1    2
2    3
3    1
4    1
dtype: int64

**ë°ì´í„°í”„ë ˆì„ ê° ì—´ì˜ ë°ì´í„°ì— ëŒ€í•œ ë²”ì£¼ë³„ ë¹ˆë„ ê³„ì‚°**

In [91]:
# df3ì˜ ê° ì—´ì˜ ë°ì´í„°ì— ëŒ€í•´ì„œ ì¹´í…Œê³ ë¦¬ ì„¸ê¸°ë¥¼ ìˆ˜í–‰í•˜ì‹œì˜¤
df3

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

In [93]:
# apply()í•¨ìˆ˜ë¥¼ ì‚¬ìš©í•´ì„œ value_counts()ì ìš© test
df3['a'].value_counts()

3    2
4    2
1    1
Name: a, dtype: int64

In [98]:
# aì—´ : 1 - 1ë²ˆ, 2 - ë‚˜íƒ€ë‚˜ì§€ ì•ŠìŒ(NaN), 3 - 2ë²ˆ, 4 2ë²ˆ , 5 - ë‚˜íƒ€ë‚˜ì§€ ì•ŠìŒ(NaN)
#af3['a'].value_counts()
df3.apply(pd.value_counts)

     a  b    c
1  1.0  1  1.0
2  NaN  1  1.0
3  2.0  1  NaN
4  2.0  1  2.0
5  NaN  1  1.0

**ê° ì—´ì˜ ë°ì´í„°ì— ëŒ€í•œ ë²”ì£¼ë³„ ë¹ˆë„ ê³„ì‚° í›„, NaNê°’ì€ 0ìœ¼ë¡œ ë³€í™˜í•˜ê³  ì „ì²´ ë°ì´í„° íƒ€ì…ì„ ì •ìˆ˜ë¡œ ë³€í™˜**

In [99]:
# df3 ê° ì—´ ë°ì´í„°ì˜ ë¹ˆë„ë¥¼ ì„¸ê³ , NaNê°’ì€ 0ìœ¼ë¡œ ë³€í™˜ ì „ì²´ ë°ì´í„° íƒ€ì…ì„ ì •ìˆ˜ë¡œ ë³€í™˜í•˜ì‹œì˜¤.
df3.apply(pd.value_counts).fillna(0).astype(int)

   a  b  c
1  1  1  1
2  0  1  1
3  2  1  0
4  2  1  2
5  0  1  1

# ğŸˆ ìˆ˜ì¹˜í˜• ë°ì´í„°ë¥¼ ë²”ì£¼í˜• ë°ì´í„°ë¡œ ë³€í™˜

: ë°ì´í„°ê°’ì„ ì¹´í…Œê³ ë¦¬ ê°’ìœ¼ë¡œ ë³€í™˜

- ê°’ì˜ í¬ê¸°ë¥¼ ê¸°ì¤€ìœ¼ë¡œ í•˜ì—¬ ì¹´í…Œê³ ë¦¬ ê°’ìœ¼ë¡œ ë³€í™˜í•˜ê³  ì‹¶ì„ë•Œ
    - **cut(data, bins, label)**
        - data : êµ¬ê°„ ë‚˜ëˆŒ ì‹¤ì œ ê°’
        - bins : êµ¬ê°„ ê²½ê³„ê°’
        - label: ì¹´í…Œê³ ë¦¬ ê°’
        
    - **qcut(data, bins, label)**

### 1. êµ¬ê°„ ê²½ê³„ì„ ì„ ì„ ì •í•˜ì—¬ ë²”ì£¼í˜• ë°ì´í„°ë¡œ ë³€í™˜ : cut()

#### ë¦¬ìŠ¤íŠ¸ ë°ì´í„°ë¥¼ ë²”ì£¼í˜• ë°ì´í„°ë¡œ ë³€í™˜
**êµ¬ê°„ì„ ë‚˜ëˆŒ ì‹¤ì œ ê°’ : ê´€ì¸¡ ë°ì´í„°**

In [104]:
ages=[0,0.5,4,6,4,5,2,10,21,23,37,15,38,31,61,20,41,31,100]

**êµ¬ê°„ ê²½ê³„ê°’, ë²”ì£¼ ë¦¬ë²¨ ì„¤ì •**

In [103]:
# êµ¬ê°„ ê²½ê³„ê°’ ì„¤ì •
bins = [0, 4, 15, 25, 35, 60, 100]

In [105]:
#label : ì¹´í…Œê³ ë¦¬ ëª…
labels = ['ì˜ìœ ì•„', 'ë¯¸ì„±ë…„ì', 'ì²­ë…„', 'ì¤‘ë…„', 'ì¥ë…„', 'ë…¸ë…„']

# 0 < ì˜ìœ ì•„ <= 4
# 4 < ë¯¸ì„±ë…„ì <= 15

**ì¹´í…Œê³ ë¦¬ ìƒì„± í•¨ìˆ˜ cut() ì ìš©**

In [107]:
# í•¨ìˆ˜ ì ìš©í•´ì„œ ì¹´í…Œê³ ë¦¬ ìƒì„±
catAge = pd.cut(ages ,bins, labels=labels)
catAge
list(catAge)

[NaN, 'ì˜ìœ ì•„', 'ì˜ìœ ì•„', 'ë¯¸ì„±ë…„ì', 'ì˜ìœ ì•„', ..., 'ë…¸ë…„', 'ì²­ë…„', 'ì¥ë…„', 'ì¤‘ë…„', 'ë…¸ë…„']
Length: 19
Categories (6, object): ['ì˜ìœ ì•„' < 'ë¯¸ì„±ë…„ì' < 'ì²­ë…„' < 'ì¤‘ë…„' < 'ì¥ë…„' < 'ë…¸ë…„']

[nan,
 'ì˜ìœ ì•„',
 'ì˜ìœ ì•„',
 'ë¯¸ì„±ë…„ì',
 'ì˜ìœ ì•„',
 'ë¯¸ì„±ë…„ì',
 'ì˜ìœ ì•„',
 'ë¯¸ì„±ë…„ì',
 'ì²­ë…„',
 'ì²­ë…„',
 'ì¥ë…„',
 'ë¯¸ì„±ë…„ì',
 'ì¥ë…„',
 'ì¤‘ë…„',
 'ë…¸ë…„',
 'ì²­ë…„',
 'ì¥ë…„',
 'ì¤‘ë…„',
 'ë…¸ë…„']

In [108]:
type(catAge)

pandas.core.arrays.categorical.Categorical

**ì°¸ê³ : Categorical í´ë˜ìŠ¤ ê°ì²´**

- ì¹´í…Œê³ ë¦¬ëª… ì†ì„± : Categorical.categories


- ì½”ë“œ ì†ì„± : Categorical.codes 
    - ì¸ì½”ë”©í•œ ì¹´í…Œê³ ë¦¬ ê°’ì„ ì •ìˆ˜ë¡œ ê°–ìŒ

In [109]:
catAge.categories

Index(['ì˜ìœ ì•„', 'ë¯¸ì„±ë…„ì', 'ì²­ë…„', 'ì¤‘ë…„', 'ì¥ë…„', 'ë…¸ë…„'], dtype='object')

In [110]:
catAge.codes
# -1ë¡œ ë‚˜ì˜¤ëŠ” ë°ì´í„°ëŠ” ê²°ì¸¡ì¹˜ë¥¼ ë‚˜íƒ€ëƒ„

array([-1,  0,  0,  1,  0,  1,  0,  1,  2,  2,  4,  1,  4,  3,  5,  2,  4,
        3,  5], dtype=int8)

### ë°ì´í„°í”„ë ˆì„ ë°ì´í„°ë¥¼ ë²”ì£¼í˜•ìœ¼ë¡œ ë³€í™˜

In [112]:
# age ë¦¬ìŠ¤íŠ¸ë¥¼ ì´ìš©í•´ì„œ df ìƒì„±
df4 = pd.DataFrame(ages, columns=['age'])
df4

      age
0     0.0
1     0.5
2     4.0
3     6.0
4     4.0
5     5.0
6     2.0
7    10.0
8    21.0
9    23.0
10   37.0
11   15.0
12   38.0
13   31.0
14   61.0
15   20.0
16   41.0
17   31.0
18  100.0

In [115]:
df5 = pd.DataFrame(data, columns=['data'])
df5['qcut']=
df5

      age age_cut
0     0.0     NaN
1     0.5     ì˜ìœ ì•„
2     4.0     ì˜ìœ ì•„
3     6.0    ë¯¸ì„±ë…„ì
4     4.0     ì˜ìœ ì•„
5     5.0    ë¯¸ì„±ë…„ì
6     2.0     ì˜ìœ ì•„
7    10.0    ë¯¸ì„±ë…„ì
8    21.0      ì²­ë…„
9    23.0      ì²­ë…„
10   37.0      ì¥ë…„
11   15.0    ë¯¸ì„±ë…„ì
12   38.0      ì¥ë…„
13   31.0      ì¤‘ë…„
14   61.0      ë…¸ë…„
15   20.0      ì²­ë…„
16   41.0      ì¥ë…„
17   31.0      ì¤‘ë…„
18  100.0      ë…¸ë…„

### 2. ë°ì´í„° ê°œìˆ˜ê°€ ê°™ë„ë¡ ë°ì´í„° ë¶„í•  :  qcut()

: êµ¬ê°„ ê²½ê³„ì„ ì„ ì§€ì •í•˜ì§€ ì•Šê³  ë°ì´í„°ì˜ ì‚¬ë¶„ìœ„ìˆ˜(quantile) ê¸°ì¤€ìœ¼ë¡œ ë¶„í• 

- í˜•ì‹ : pd.qcut(data,êµ¬ê°„ìˆ˜,labels=[d1,d2....])
    
    
    - ì˜ˆ)1000ê°œì˜ ë°ì´í„°ë¥¼ 4êµ¬ê°„ìœ¼ë¡œ ë‚˜ëˆ„ë ¤ê³  í•œë‹¤ë©´
        - qcut ëª…ë ¹ì–´ë¥¼ ì‚¬ìš© í•œ êµ¬ê°„ë§ˆë‹¤ 250ê°œì”© ë‚˜ëˆ„ê²Œ ëœë‹¤.
        - ì˜ˆì™¸)ê°™ì€ ìˆ«ìì¸ ê²½ìš°ì—ëŠ” ê°™ì€ êµ¬ê°„ìœ¼ë¡œ ì²˜ë¦¬í•œë‹¤.

**ëœë¤ì •ìˆ˜ 20ê°œë¥¼ ìƒì„±í•˜ê³  ìƒì„±ëœ ì •ìˆ˜ë¥¼ 4ê°œì˜ êµ¬ê°„ìœ¼ë¡œ ë‚˜ëˆ„ì‹œì˜¤.**

: ê° êµ¬ê°„ì˜ labelì€ Q1,Q2,Q3,Q4 ë¡œ ì„¤ì •

In [116]:
# ëœë¤ì •ìˆ˜ ìƒì„± : ë²”ìœ„ 0-19, size =20
# seed ì„¤ì •í•´ì„œ ì¬ ì‹¤í–‰í•´ë„ ëœë¤ì •ìˆ˜ê°€ ë³€í•˜ì§€ ì•Šë„ë¡ ìƒì„±

# seed ì„¤ì •
np.random.seed(2)

# ëœë¤ì •ìˆ˜ ìƒì„±
data = np.random.randint(20,size=20)
data

array([ 8, 15, 13,  8, 11, 18, 11,  8,  7,  2, 17, 11, 15,  5,  7,  3,  6,
        4, 10, 11])

In [117]:
qcutData = pd.qcut(data, 4, labels=['Q1','Q2','Q3','Q4'])
qcutData

['Q2', 'Q4', 'Q4', 'Q2', 'Q3', ..., 'Q1', 'Q1', 'Q1', 'Q3', 'Q3']
Length: 20
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [118]:
np.sort(data)

array([ 2,  3,  4,  5,  6,  7,  7,  8,  8,  8, 10, 11, 11, 11, 11, 13, 15,
       15, 17, 18])

In [124]:
#ê°’ì´ ê²¹ì¹˜ë©´ ê°™ì€ êµ¬ê°„ìœ¼ë¡œ ë“¤ì–´ê°€ê²Œ ëœë‹¤.
pd.value_counts(qcutData)

Q1    5
Q2    5
Q3    5
Q4    5
dtype: int64

In [ ]:
df4['age_cut'] = pd.cut(df4.age, bins, labels=labels)
df4

### â“ ì—°ìŠµë¬¸ì œ : ìˆ˜ì¹˜í˜•-> ë²”ì£¼í˜• ë°ì´í„° ìƒì„±

: íƒ€ì´íƒ€ë‹‰í˜¸ ìŠ¹ê°ì„ ì‚¬ë§ìì™€ ìƒì¡´ì ê·¸ë£¹ìœ¼ë¡œ ë‚˜ëˆ„ê³ (alive), ê° ê·¸ë£¹ì— ëŒ€í•´ ë¯¸ì„±ë…„ì, ì²­ë…„, ì¤‘ë…„, ì¥ë…„, ë…¸ë…„ ìŠ¹ê°ì˜ ë¹„ìœ¨ì„ êµ¬í•˜ì‹œì˜¤.

- bins=[1,15,25,35,60,99]
- labels=['ë¯¸ì„±ë…„ì','ì²­ë…„','ì¤‘ë…„','ì¥ë…„','ë…¸ë…„']
- ê° ê·¸ë£¹ë³„ ë¹„ìœ ì˜ ì „ì²´ í•©ì€ 1ì´ ë˜ì–´ì•¼ í•œë‹¤.

**íƒ€ì´íƒ€ë‹‰ ë°ì´í„°ì…‹ ë¡œë”©**

In [217]:
# íƒ€ì´íƒ€ë‹‰ ìŠ¹ê° dataset ì½ì–´ì˜¤ê¸°
import seaborn as sns 
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

**ë°ì´í„° ì…‹ ë¶„ë¦¬ : ìƒì¡´ì ê·¸ë£¹ê³¼ ì‚¬ë§ì ê·¸ë£¹**

In [221]:
# ì‚¬ë§ì ê·¸ë£¹ ë°ì´í„° í”„ë ˆì„ ì¶”ì¶œ
titanicDead = titanic[titanic['alive'] == 'no']
titanicDead

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [223]:
# ìƒì¡´ì ê·¸ë£¹ ë°ì´í„° í”„ë ˆì„ ì¶”ì¶œ
titanicAlive = titanic[titanic['alive'] == 'yes']
titanicAlive

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True

**ë°ì´í„° ë²”ìœ„ ì„¤ì •**

In [233]:
# ë¼ë²¨ê³¼ ë²”ìœ„ ê°„ê²© ì„¤ì •

bins=[0.1,15,25,35,60,99]
labels=['ë¯¸ì„±ë…„ì','ì²­ë…„','ì¤‘ë…„','ì¥ë…„','ë…¸ë…„']

In [234]:
# ë²”ìœ„ ìœ íš¨ì„± ê²€ì‚¬
# bins=[0,15,25,35,60,99]
titanicDead['age'].min()
titanicDead['age'].max()

titanicAlive['age'].min()
titanicAlive['age'].max()



#ì œì‹œëœ binsì˜ ìµœì´ˆê°’ 1 ì´í•˜ì¸ ê°’ 1.0ê³¼ 0.42ê°€ ê°
#ê·¸ë£¹ì˜ ìµœì†Œë‚˜ì´ë¡œ í™•ì¸ë˜ë¯€ë¡œ bins ìˆ˜ì •
#ìµœëŒ€ë‚˜ì´ëŠ” 74ì™€ 80ìœ¼ë¡œ í™•ì¸ë˜ì–´ì„œ ìˆ˜ì • í•„ìš” ì—†ìŒ

1.0

74.0

0.42

80.0

In [228]:
# Warning í‘œì‹œ ì•ˆí•˜ë„ë¡ ì„¤ì •
import warnings
warnings.filterwarnings('ignore')

**ë²”ì£¼í˜• ë°ì´í„° ìƒì„±**

In [237]:
# ì¹´í…Œê³ ë¦¬ ë°ì´í„° ìƒì„±
titanicDead['age_cut'] = pd.cut(titanicDead.age,bins,labels=labels)
titanicAlive['age_cut'] = pd.cut(titanicAlive.age,bins,labels=labels)

**ë²”ì£¼í˜• ë°ì´í„° í™•ì¸**

In [238]:
#ì¹´í…Œê³ ë¦¬ ë°ì´í„° í™•ì¸
titanicDead
titanicAlive

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_cut
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,ì²­ë…„
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,ì¤‘ë…„
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True,NaN
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True,ì¥ë…„
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False,ë¯¸ì„±ë…„ì
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True,ì²­ë…„
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False,ì¥ë…„
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,ì¤‘ë…„
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,ì¤‘ë…„

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_cut
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,ì¥ë…„
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,ì¤‘ë…„
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,ì¤‘ë…„
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False,ì¤‘ë…„
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False,ë¯¸ì„±ë…„ì
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
875,1,3,female,15.0,0,0,7.2250,C,Third,child,False,NaN,Cherbourg,yes,True,ë¯¸ì„±ë…„ì
879,1,1,female,56.0,0,1,83.1583,C,First,woman,False,C,Cherbourg,yes,False,ì¥ë…„
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False,ì²­ë…„
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,ì²­ë…„
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,ì¤‘ë…„

**ë²”ì£¼í˜• ë°ì´í„° ë¹ˆë„ ê³„ì‚°**

- ì‚¬ë§ì ê·¸ë£¹ì˜ ì—°ë ¹ëŒ€ë³„ ìŠ¹ê°ìˆ˜

In [241]:
# ì¹´í…Œê³ ë¦¬ ë°ì´í„°ë“¤ì˜ ë¹ˆë„ ìˆ˜ ê³„ì‚°
titanicDead['age_cut'].value_counts()

# ì‚¬ë§ìê·¸ë£¹ ê³„ì‚°
titanicDead['age_cut'].value_counts().sum()

# ê° ì—°ë ¹ëŒ€ë³„ ìŠ¹ê°ìˆ˜ì˜ ë¹„ìœ¨ ê³„ì‚°
pd.value_counts(titanicDead['age_cut'],normalize = True)

# ì „ì²´ ë¹„ìœ¨ì˜ í•© ê³„ì‚°
pd.value_counts(titanicDead['age_cut'],normalize = True).sum()

ì²­ë…„      143
ì¥ë…„      117
ì¤‘ë…„      113
ë¯¸ì„±ë…„ì     34
ë…¸ë…„       17
Name: age_cut, dtype: int64

424

ì²­ë…„      0.337264
ì¥ë…„      0.275943
ì¤‘ë…„      0.266509
ë¯¸ì„±ë…„ì    0.080189
ë…¸ë…„      0.040094
Name: age_cut, dtype: float64

1.0

- ìƒì¡´ì ê·¸ë£¹ ë¹ˆë„

In [242]:
titanicAlive['age_cut'].value_counts()

ì¤‘ë…„      83
ì¥ë…„      78
ì²­ë…„      75
ë¯¸ì„±ë…„ì    49
ë…¸ë…„       5
Name: age_cut, dtype: int64

In [243]:
# ì¹´í…Œê³ ë¦¬ ë°ì´í„°ë“¤ì˜ ë¹ˆë„ ìˆ˜ ê³„ì‚°
titanicAlive['age_cut'].value_counts()

# ìƒì¡´ìê·¸ë£¹ ê³„ì‚°
titanicAlive['age_cut'].value_counts().sum()

# ê° ì—°ë ¹ëŒ€ë³„ ìŠ¹ê°ìˆ˜ì˜ ë¹„ìœ¨ ê³„ì‚°
pd.value_counts(titanicAlive['age_cut'],normalize = True)

# ì „ì²´ ë¹„ìœ¨ì˜ í•© ê³„ì‚°
pd.value_counts(titanicAlive['age_cut'],normalize = True).sum()

ì¤‘ë…„      83
ì¥ë…„      78
ì²­ë…„      75
ë¯¸ì„±ë…„ì    49
ë…¸ë…„       5
Name: age_cut, dtype: int64

290

ì¤‘ë…„      0.286207
ì¥ë…„      0.268966
ì²­ë…„      0.258621
ë¯¸ì„±ë…„ì    0.168966
ë…¸ë…„      0.017241
Name: age_cut, dtype: float64

1.0

------------------------

# ğŸˆ ì¸ë±ìŠ¤ ì„¤ì •

### âœ ë°ì´í„°í”„ë ˆì„ ì¸ë±ìŠ¤ ì„¤ì •: set_index(), reset_index()

- ê¸°ë³¸ì¸ë±ìŠ¤ : 0ë¶€í„° 1ì”© ì¦ê°€í•˜ëŠ” ì •ìˆ˜ ì¸ë±ìŠ¤
    - ë”°ë¡œ ì„¤ì •í•˜ì§€ ì•Šìœ¼ë©´ ê¸°ì¡´ ì¸ë±ìŠ¤ëŠ” ë°ì´í„°ì—´ë¡œ ì¶”ê°€ ë¨
    
    
- set_index() : ê¸°ì¡´ í–‰ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ë°ì´í„° ì—´ ì¤‘ í•˜ë‚˜ë¥¼ ì¸ë±ìŠ¤ë¡œ ì„¤ì •í•´ì£¼ëŠ” í•¨ìˆ˜


- reset_index() : ê¸°ì¡´ í–‰ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ê¸°ë³¸ì¸ë±ìŠ¤ë¡œ ë³€ê²½

### âœ” ë°ì´í„°í”„ë ˆì„ ìƒì„±

In [149]:
# ì˜ˆì œ ë°ì´í„°í”„ë ˆì„ ìƒì„±
df3 = pd.DataFrame({
    'a':[1,3,4,3,4],
    'b':[2,3,1,4,5],
    'c':[1,5,2,4,4]
})
df3

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

### âœ” ë°ì´í„°í”„ë ˆì„ì˜ ì¸ë±ìŠ¤ë¥¼ aì—´ë¡œ ì„¤ì •

In [150]:
# df3ì€ index ì„¤ì •ì´ ì—†ì–´ì„œ ê¸°ë³¸ ì¸ë±ìŠ¤ë¡œ ìƒì„±ë˜ì–´ ìˆìŒ
# df3 ë°ì´í„° í”„ë ˆì„ì˜ ì¸ë±ìŠ¤ë¥¼ a ì—´ë¡œ ì„¤ì •í•˜ì‹œì˜¤.
df3 = df3.set_index('a')
df3

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

**í–‰ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ê¸°ë³¸ ì¸ë±ìŠ¤ë¡œ ì„¤ì •**

In [152]:
# df3ì˜ í–‰ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ê¸°ë³¸ ì¸ë±ìŠ¤ë¡œ ì„¤ì •í•˜ì‹œì˜¤.
# df3.reset_index()

## ì›ë˜ indexì˜ ì²˜ë¦¬ : ì„¤ì • ì—†ìœ¼ë©´ ì› ì¸ë±ìŠ¤ê°€ dataë¡œ ì²˜ë¦¬

df3 = df3.reset_index(drop=True)
df3

## ì›ë˜ indexì˜ ì²˜ë¦¬ : ì›index ì œê±° (drop=True)
## ì›ë³¸ ë°˜ì˜ë˜ì§€ ì•Šìœ¼ë¯€ë¡œ ë°˜ë“œì‹œ ì €ì¥í•´ì•¼ í•œë‹¤.

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

**ì¸ë±ìŠ¤ ì´ë¦„ ë°”ê¾¸ê¸°**

In [157]:
#i ndex ì´ë¦„ ë°”ê¾¸ê¸°(í–‰ ì¸ë±ìŠ¤)
# df3 ë°ì´í„° í”„ë ˆì„ì˜ ì¸ë±ìŠ¤ë¥¼ ì œê±°í•˜ê³  ê¸°ë³¸ ì¸ë±ìŠ¤ë¡œ ì„¤ì •í•˜ì‹œì˜¤.
# ë‹¨, ì› ì¸ë±ìŠ¤ëŠ” ì‚­ì œí•œë‹¤.
df3 = df3.rename(index={0:'1ë°˜'})

**í–‰ì¸ë±ìŠ¤ì˜ ì²«ë²ˆì§¸ ì¸ë±ìŠ¤ ê°’ì„ 1ë°˜ìœ¼ë¡œ ë³€ê²½**

In [100]:
# í–‰ì¸ë±ìŠ¤ì˜ ì²«ë²ˆì§¸ ì¸ë±ìŠ¤ ê°’ì„ 1ë°˜ìœ¼ë¡œ ë°”ê¾¸ì‹œì˜¤
# rename() ì‚¬ìš©
# df.rename(index={í˜„ì¬ì¸ë±ìŠ¤:ë°”ê¿€ì¸ë±ìŠ¤})

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

    b  c
1ë°˜  2  1
1   3  5
2   1  2
3   4  4
4   5  4

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

**ì—´ì´ë¦„ ê°’ ë³€ê²½**

In [158]:
# ì—´ì´ë¦„(columns) ì²«ë²ˆì§¸ ì´ë¦„ ê°’ì„ í•™ìƒìœ¼ë¡œ ë°”ê¾¸ì‹œì˜¤
# rename() ì‚¬ìš©
# df.rename(columns={í˜„ì¬ì»¬ëŸ¼ëª…:ë°”ê¿€ì»¬ëŸ¼ëª…})
df3.rename(columns={'b':'í•™ìƒ'})

    í•™ìƒ  c
1ë°˜   2  1
1    3  5
2    1  2
3    4  4
4    5  4